# Data Cleaning

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('C:\\Users\\Hp\\OneDrive - Shri Vile Parle Kelavani Mandal\\Desktop\\3rd Year\\DAV\\practice\\data\\emp.csv')
df.head()

   Emp_ID   Name   Age      Sal  Experience     Dept Joining_Date  Per_score
0   101.0   John  25.0  50000.0         2.0       IT    6/15/2019       85.0
1   102.0  Alice  30.0  60000.0         5.0       HR    4/22/2018       90.0
2   103.0    Bob  35.0      NaN        10.0  Finance    7/11/2015       78.0
3   104.0    Eve  28.0  55000.0         4.0       IT     1/5/2020       88.0
4   105.0   Mike  40.0  75000.0        12.0  Finance    9/18/2010       92.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Emp_ID        46 non-null     float64
 1   Name          46 non-null     object
 2   Age           43 non-null     float64
 3   Sal           41 non-null     float64
 4   Experience    45 non-null     float64
 5   Dept          44 non-null     object
 6   Joining_Date  46 non-null     object
 7   Per_score     44 non-null     float64
dtypes: float64(5), object(3)
memory usage: 3.1+ KB

In [4]:
df.describe()

           Emp_ID        Age           Sal  Experience  Per_score
count   46.000000  43.000000     41.000000   45.000000  44.000000
mean   123.217391  33.488372  64658.536585    8.400000  88.272727
std     13.039961   7.102555  11791.119023    5.487175   4.667371
min    101.000000  23.000000  48000.000000    1.000000  78.000000
25%    112.250000  28.000000  55000.000000    4.000000  85.000000
50%    123.500000  32.000000  63000.000000    8.000000  88.000000
75%    134.750000  38.000000  72000.000000   12.000000  91.250000
max    145.000000  50.000000  90000.000000   20.000000  97.000000

In [5]:
df.columns

Index(['Emp_ID', 'Name', 'Age', 'Sal', 'Experience', 'Dept', 'Joining_Date',
       'Per_score'],
      dtype='object')

In [6]:
df.isnull().sum()

Emp_ID          2
Name            2
Age             5
Sal             7
Experience      3
Dept            4
Joining_Date    2
Per_score       4
dtype: int64

In [7]:
df.shape

(48, 8)

In [8]:
df.duplicated().any()

True

In [9]:
df.duplicated().sum()

4

In [10]:
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])

In [11]:
df[df.duplicated()]

    Emp_ID      Name   Age      Sal  Experience Dept Joining_Date  Per_score
43     NaN       NaN   NaN      NaN         NaN  NaN          NaT        NaN
45   145.0     Logan  27.0  53000.0         3.0   IT   2020-06-17       84.0
46   137.0  Victoria  33.0  64000.0         8.0   HR   2017-04-30       87.0
47   138.0    Joseph  28.0  56000.0         4.0   IT   2019-09-23       86.0

In [12]:
df['Sal'].fillna(df['Sal'].mean(), inplace=True)

In [13]:
df['Emp_ID'] = df['Emp_ID'].fillna(df['Emp_ID'].mode()[0])

In [14]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [15]:
df['Dept'] = df['Dept'].fillna(df['Dept'].mode()[0])

In [16]:
df['Experience'] = df['Experience'].fillna(df['Experience'].median())

In [17]:
df['Name'] = df['Name'].fillna(df['Name'].mode()[0])

In [18]:
df['Per_score'] = df['Per_score'].fillna(df['Per_score'].median())

In [19]:
df['Joining_Date'] = df['Joining_Date'].fillna(df['Joining_Date'].mode()[0])

In [20]:
df.isnull().sum()

Emp_ID          0
Name            0
Age             0
Sal             0
Experience      0
Dept            0
Joining_Date    0
Per_score       0
dtype: int64

In [21]:
df.dtypes

Emp_ID                 float64
Name                    object
Age                    float64
Sal                    float64
Experience             float64
Dept                    object
Joining_Date    datetime64[ns]
Per_score              float64
dtype: object

In [22]:
df.duplicated().sum()

4

In [23]:
df.drop_duplicates(inplace=True)